Autodesk.Revit.DB.SharedParameterElement.Lookup(Autodesk.Revit.DB.Document,System.Guid)
Finds the shared parameter element that corresponds to the given Guid.
document:
The document.
guidValue:
Shared parameter Guid.
Returns:
The retrieved shared parameter instance, or null if the matching element is not found.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.DB.SharedParameterElement.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ExternalDefinition)
Creates a new shared parameter element in the document representing the parameter stored in the input ExternalDefinition.
document:
The document.
sharedParameterDefinition:
Shared parameter definition.
Returns:
The newly created shared parameter instance.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
A shared parameter with the assigned GUID is already loaded into the document.
Since:
2016

Autodesk.Revit.DB.SharedParameterElement.GuidValue
The Guid that identifies this shared parameter.
Since:
2016

Autodesk.Revit.DB.SharedParameterElement
An element that stores the definition of a shared parameter which is loaded into the document.
Remarks:
Shared parameters are user-defined parameters that can be shared by multiple
Revit documents. A shared parameter is identified by a GUID.
Basic information of the shared parameter are accessed through GetDefinition().
Since:
2016